src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ТребуетсяПодтверждение/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры();
	
	ЗаполнитьПанельНавигации();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПричинаДобавленияОбъектыКЗагрузке" Тогда
		
		Элементы.СписокТребуетсяПодтверждение.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	УстановленоСоответствиеОтборНастройки = Настройки.Получить("УстановленоСоответствиеОтбор");
	
	Если УстановленоСоответствиеОтборНастройки <> Неопределено Тогда
		
		Настройки.Удалить("УстановленоСоответствиеОтбор");
		УстановленоСоответствиеОтбор = УстановленоСоответствиеОтборНастройки;
		ИзменитьОтборУстановленоСоответствие();
		
	КонецЕсли;
	
	ТекущийТипОбъектаНастройки = Настройки.Получить("ТекущийТипОбъекта");
	
	ИдентификаторСтрокиТипыОбъектов = - 1;
	
	Если ТекущийТипОбъектаНастройки <> Неопределено Тогда
		
		Настройки.Удалить("ТекущийТипОбъекта");
		ТекущийТипОбъекта = ТекущийТипОбъектаНастройки;
		
		Если ЗначениеЗаполнено(ТекущийТипОбъекта) Тогда
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ИдентификаторОбъектаМетаданных", ТекущийТипОбъекта);
			
			НайденныеСтроки = ТипыОбъектов.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				УстановитьОтборТипМетаданных(ТекущийТипОбъекта);
				ИдентификаторСтрокиТипыОбъектов = НайденныеСтроки[0].ПолучитьИдентификатор();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПанельТиповСкрытаНастройки = Настройки.Получить("ПанельТиповСкрыта");
	
	Если ПанельТиповСкрытаНастройки <> Неопределено Тогда
		
		Настройки.Удалить("ПанельТиповСкрыта");
		ПанельТиповСкрыта = ПанельТиповСкрытаНастройки;
		УправлениеДоступностью(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ТипыОбъектов.ТекущаяСтрока = ИдентификаторСтрокиТипыОбъектов;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановленоСоответствиеОтборПриИзменении(Элемент)
	
	ИзменитьОтборУстановленоСоответствие();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДействияПриПолученииДанныхОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуДействияПриПолученияДанных" Тогда 
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыОбъектов

&НаКлиенте
Процедура ТипыОбъектовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПослеАктивизацииСтрокиТипыОбъектов", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТребуетсяПодтверждение

&НаСервереБезКонтекста
Процедура СписокТребуетсяПодтверждениеПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РаботаСРезультатамиОбмена.ПолучитьПредставленияОбъектовПриПолученииДанныхНаСервереСписка(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокТребуетсяПодтверждение.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокТребуетсяПодтверждениеПредставлениеОбъекта" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылкаНаОбъект) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылкаНаОбъект);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокТребуетсяПодтверждениеСоответствиеВИБ" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
			ПоказатьЗначение(, ТекущиеДанные.СоответствиеВИБ);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуПроблемы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьПанель(Команда)
	
	ПанельТиповСкрыта = Ложь;
	УправлениеДоступностью(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПанель(Команда)
	
	ПанельТиповСкрыта = Истина;
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НеТребуетПодтвержденияСписок(Команда)
	
	ОчиститьСообщения();
	
	КлючиЗаписейКОтменеПодтверждения = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокТребуетсяПодтверждение.ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.ОбъектыКЗагрузке") Тогда
			
			КлючиЗаписейКОтменеПодтверждения.Добавить(ВыделеннаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КлючиЗаписейКОтменеПодтверждения.Количество() > 0 Тогда
		
		РезультатОтмены = РезультатОтменыНеобходимостиПодтвержденияИзСпискаОбъектов(КлючиЗаписейКОтменеПодтверждения, УзелИнформационнойБазы);
		
		ОбработатьРезультатыОтменыНеобходимостиПодтверждения(РезультатОтмены);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не выбрана ни одна строка для отмены необходимости подтверждения'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"СписокТребуетсяПодтверждение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеТребуетПодтверждение(Команда)
	
	ОчиститьСообщения();
	
	ТипыОбъектовКОтменеПодтверждения = Новый Массив;
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ТипыОбъектов.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТипыОбъектов.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		Если ДанныеСтроки <> Неопределено
			И ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторОбъектаМетаданных) Тогда
			
			ТипыОбъектовКОтменеПодтверждения.Добавить(ДанныеСтроки.ИдентификаторОбъектаМетаданных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипыОбъектовКОтменеПодтверждения.Количество() > 0 Тогда
		
		РезультатОтмены = РезультатОтменыНеобходимостиПодтверждения(ТипыОбъектовКОтменеПодтверждения, УзелИнформационнойБазы);
		
		ОбработатьРезультатыОтменыНеобходимостиПодтверждения(РезультатОтмены);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не выбран ни один тип объекта для отмены необходимости подтверждения'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ТипыОбъектов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъектИзФормыСписка(ЭтотОбъект, "СписокТребуетсяПодтверждение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(ЭтотОбъект, "СписокТребуетсяПодтверждение");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьЗагрузкуВыделенныхОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	ЗагрузитьВыделенныеОбъекты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокТребуетсяПодтверждение.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокТребуетсяПодтверждение, "УзелПланаОбмена", УзелИнформационнойБазы, Истина);
	НавигационнаяСсылкаФормы = РаботаСРезультатамиОбмена.НавигационнаяСсылкаФормыСписка(ЭтотОбъект);
	
	УстановленоСоответствиеОтбор = "Все";
	
	ИдентификаторСтрокиТипыОбъектов = - 1;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = СписокТребуетсяПодтверждение.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, "ПредставлениеОбъекта");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПанелиНавигации

&НаСервере
Процедура ЗаполнитьПанельНавигации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ОбъектМетаданных             КАК ОбъектМетаданных,
	|	КОЛИЧЕСТВО(ОбъектыКЗагрузке.ПолученныйОбъект) КАК КоличествоОбъектов
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО (ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|				И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = &УзелПланаОбмена
	|				И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата)
	|ГДЕ
	|	(ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.ОбъектМетаданных";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОбъектыМетаданных  = Новый Соответствие;
	ИдентификаторыМетаданных = Новый Массив;
	ВсегоОбъектов            = 0;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СтрокаТаблицы = ТипыОбъектов.Добавить();
		
		СтрокаТаблицы.ИдентификаторОбъектаМетаданных = Выборка.ОбъектМетаданных;
		СтрокаТаблицы.КоличествоОбъектов             = Выборка.КоличествоОбъектов;
		
		СтрокиОбъектыМетаданных.Вставить(СтрокаТаблицы.ИдентификаторОбъектаМетаданных, СтрокаТаблицы);
		
		ИдентификаторыМетаданных.Добавить(СтрокаТаблицы.ИдентификаторОбъектаМетаданных);
		
		ВсегоОбъектов = ВсегоОбъектов + СтрокаТаблицы.КоличествоОбъектов;
	
	КонецЦикла;
	
	ЗаполнитьДанныеОбъектаМетаданныхВТаблицеТипов(ИдентификаторыМетаданных, СтрокиОбъектыМетаданных);
	
	СтрокаВсего = ТипыОбъектов.Вставить(0);
	СтрокаВсего.СинонимОбъектаМетаданных = НСтр("ru = 'Всего объектов'");
	СтрокаВсего.КоличествоОбъектов       = ВсегоОбъектов;
	СтрокаВсего.ИндексКартинки           = 18;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъектаМетаданныхВТаблицеТипов(ИдентификаторыМетаданных, СтрокиОбъектыМетаданных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.Синоним   КАК Синоним,
	|	ИдентификаторыОбъектовМетаданных.Ссылка    КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В(&ИдентификаторыМетаданных)";
	
	Запрос.УстановитьПараметр("ИдентификаторыМетаданных", ИдентификаторыМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = СтрокиОбъектыМетаданных.Получить(Выборка.Ссылка);
		
		СтрокаТаблицы.СинонимОбъектаМетаданных = Выборка.Синоним;
		СтрокаТаблицы.ИндексКартинки           = РаботаСРезультатамиОбмена.ИндексКартинкиТипаОбъектовМетаданных(Выборка.ПолноеИмя);
		СтрокаТаблицы.ПолноеИмяТипаОбъекта     = Выборка.ПолноеИмя;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтборов 

&НаКлиенте
Процедура ПослеАктивизацииСтрокиТипыОбъектов()
	
	ТекущиеДанные = Элементы.ТипыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийТипОбъекта = ТекущиеДанные.ИдентификаторОбъектаМетаданных Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийТипОбъекта = ТекущиеДанные.ИдентификаторОбъектаМетаданных;
	
	УстановитьОтборТипМетаданных(ТекущиеДанные.ИдентификаторОбъектаМетаданных);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТипМетаданных(ОбъектМетаданныхДляОтбора)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокТребуетсяПодтверждение,
	                                                                        "ОбъектМетаданных",
	                                                                        ОбъектМетаданныхДляОтбора,
	                                                                        ВидСравненияКомпоновкиДанных.ВСписке,
	                                                                        ,
	                                                                        ЗначениеЗаполнено(ОбъектМетаданныхДляОтбора));
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтборУстановленоСоответствие()
	
	ВидСравненияДляОтбора = Неопределено;
	
	Если УстановленоСоответствиеОтбор = "Новые" Тогда
		
		ВидСравненияДляОтбора = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
	Иначе
		
		ВидСравненияДляОтбора = ВидСравненияКомпоновкиДанных.Заполнено;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокТребуетсяПодтверждение,
	                                                                        "СсылкаНаОбъект",
	                                                                        ,
	                                                                        ВидСравненияДляОтбора,
	                                                                        ,
	                                                                        УстановленоСоответствиеОтбор <> "Все");

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	СписокТребуетсяПодтверждение.Параметры.УстановитьЗначениеПараметра("НачалоПериода",
		Период.ДатаНачала);
	СписокТребуетсяПодтверждение.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(Дата(3999, 12, 31)))); 
		
	Элементы.ДекорацияОтборПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания,);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ПоказатьПанель.Видимость     = Форма.ПанельТиповСкрыта;
	ЭлементыФормы.ГруппаТипыОбъектов.Видимость = НЕ Форма.ПанельТиповСкрыта;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)

	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект, 
		ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение"), ОповещениеОЗакрытииФормыПроблемы);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.УстановленоСоответствие Тогда
		
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(
			Результат.ПолученныйОбъект, Результат.ОбъектФормата, УзелИнформационнойБазы, Результат.ИдентификаторФоновогоЗадания);
		
	КонецЕсли;
		
	Если Результат.ОткрытьОбъектИБПослеОбработки
		И ЗначениеЗаполнено(Результат.ОбъектИБ) Тогда
		
		ПоказатьЗначение(, Результат.ОбъектИБ);
		
	ИначеЕсли Результат.ПереоткрытьФормуПроблему Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПереоткрытьФормуПроблемыПослеОтработки(ЭтотОбъект, Результат);
		
	ИначеЕсли Результат.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		ПоказатьПредупреждение(,Результат.ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтменаНеобходимостиПодтверждения

&НаСервере
Функция РезультатОтменыНеобходимостиПодтверждения(ТипыОбъектовКОтменеПодтверждения, УзелИнформационнойБазы)
	
	Возврат РегистрыСведений.ДействияПриПолученииДанныхОбмена.РезультатОтменыНеобходимостиПодтверждения(ТипыОбъектовКОтменеПодтверждения, УзелИнформационнойБазы);
	
КонецФункции 

&НаСервере
Функция РезультатОтменыНеобходимостиПодтвержденияИзСпискаОбъектов(КлючиЗаписей, УзелПланаОбмена)
	
	ТаблицаКлючей = РегистрыСведений.ОбъектыКЗагрузке.НовыйТаблицаКлючейЗаписей();
	
	Для Каждого КлючЗаписи Из КлючиЗаписей Цикл
		
		НоваяСтрока = ТаблицаКлючей.Добавить();
		НоваяСтрока.ПолученныйОбъект   = КлючЗаписи.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации = КлючЗаписи.ПравилоКонвертации;
		НоваяСтрока.ОбъектФормата      = КлючЗаписи.ОбъектФормата;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КлючиЗаписей.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	КлючиЗаписей.ПравилоКонвертации КАК ПравилоКонвертации,
	|	КлючиЗаписей.ОбъектФормата      КАК ОбъектФормата
	|ПОМЕСТИТЬ КлючиЗаписей
	|ИЗ
	|	&ТаблицаКлючей КАК КлючиЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыКЗагрузке.ОбъектМетаданных КАК ОбъектМетаданных
	|ИЗ
	|	КлючиЗаписей КАК КлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО КлючиЗаписей.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И (КлючиЗаписей.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации)
	|			И (КлючиЗаписей.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата)
	|ГДЕ 
	|	ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена";
	
	Запрос.УстановитьПараметр("ТаблицаКлючей",   ТаблицаКлючей);
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипыОбъектовКОтменеПодтверждения = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
	
		ТипыОбъектовКОтменеПодтверждения.Добавить(Выборка.ОбъектМетаданных);
	
	КонецЦикла;
	
	Возврат РегистрыСведений.ДействияПриПолученииДанныхОбмена.РезультатОтменыНеобходимостиПодтверждения(ТипыОбъектовКОтменеПодтверждения, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатыОтменыНеобходимостиПодтверждения(РезультатОтмены)

	Если РезультатОтмены.Успешно Тогда
		
		Если РезультатОтмены.Изменено = 0 Тогда
			
			ТекстПояснения = НСтр("ru = 'Ни для одного объекта изменения не выполнены'");
			
		Иначе
			
			ТекстПояснения = СтрШаблон(НСтр("ru = 'Изменения выполнены для типов объектов - %1 из %2'"), РезультатОтмены.Изменено, РезультатОтмены.КИзменению);
			
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена необходимости подтверждения'"),, ТекстПояснения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отменить необходимость подтверждения по причине: %1'"), РезультатОтмены.ТекстОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ТипыОбъектов");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы,
			                                                                       ДополнительныеПараметры.ТекущиеДанные);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат,
			                                  ДополнительныеПараметры.ПолученныйОбъект,
			                                  ДополнительныеПараметры.ПравилоКонвертации, 
			                                  ДополнительныеПараметры.ОбъектФормата);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат,
		                                  ДополнительныеПараметры.ПолученныйОбъект,
		                                  ДополнительныеПараметры.ПравилоКонвертации, 
		                                  ДополнительныеПараметры.ОбъектФормата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата)
	
	РезультатОтражения = РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, ВыбранныйОбъект);
	
	Если РезультатОтражения.Успешно Тогда
		
		Элементы.СписокТребуетсяПодтверждение.Обновить();
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, РезультатОтражения.ИдентификаторФоновогоЗадания);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтражения.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции 

&НаСервере
Функция РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект)
	
	Возврат РаботаСРезультатамиОбмена.РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, КлючФоновогоЗадания)
	
	ДлительнаяОперация = ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, 
		КлючФоновогоЗадания,
		ПолученныйОбъект,
		ОбъектФормата,
		УзелИнформационнойБазы);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПослеУстановкиСоответствия(УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодтверждениеЗагрузки

&НаКлиенте
Процедура ЗагрузитьВыделенныеОбъекты()
	
	ОчиститьСообщения();
	
	КлючиЗаписейКОбработке = РаботаСРезультатамиОбменаКлиент.КлючиЗаписейВыделенныхСтрокСписка(ЭтотОбъект, "СписокТребуетсяПодтверждение");
	
	Если КлючиЗаписейКОбработке.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныГотовКЗагрузке(РезультатИзмененияПричины);
	
	ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины);
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины)
	
	Если РезультатИзмененияПричины.КоличествоОбработано = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор, 
		РезультатИзмененияПричины.ИдентификаторФоновогоЗадания); 
		
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ЗагрузитьОбъектыФоновымЗаданиемЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьОбъектыФоновымЗаданиемЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗагрузкиОбъектов(УникальныйИдентификатор, КлючФоновогоЗадания)
	
	ПараметрыПередачи = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
	
	ПараметрыПередачи.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина;
	ПараметрыПередачи.ПодтверждениеЗагрузкиВыполнено                 = Истина;
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор,
		УзелИнформационнойБазы,
		КлючФоновогоЗадания,
		ПараметрыПередачи);
	
КонецФункции

#КонецОбласти

#Область ОтклонениеЗагрузки

&НаКлиенте
Процедура ОтклонитьЗагрузкуВыделенныхОбъектов()
	
	ОчиститьСообщения();
	
	КлючиЗаписейКОбработке = РаботаСРезультатамиОбменаКлиент.КлючиЗаписейВыделенныхСтрокСписка(ЭтотОбъект, "СписокТребуетсяПодтверждение");
	
	Если КлючиЗаписейКОбработке.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныЗагрузкаОтклонена(РезультатИзмененияПричины);
	
	УдалитьОтклоненныеЗаписиФоновымЗаданием(РезультатИзмененияПричины);
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке);
	
КонецФункции

&НаКлиенте
Процедура УдалитьОтклоненныеЗаписиФоновымЗаданием(РезультатИзмененияПричины)
	
	Если РезультатИзмененияПричины.КоличествоОбработано = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияУдаленияОтклоненныхЗаписей(
		УникальныйИдентификатор, 
		РезультатИзмененияПричины.ИдентификаторФоновогоЗадания);

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияУдаленияОтклоненныхЗаписей(УникальныйИдентификатор, КлючФоновогоЗадания)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияУдаленияОтклоненныхЗаписей(
		УникальныйИдентификатор, КлючФоновогоЗадания);
	
КонецФункции

#КонецОбласти

#КонецОбласти
